fa-xbrl/src/Enums/velpo_ConsolidatedRatings/velpo_ConsolidatedRatings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>velpo_ConsolidatedRatings</name>
  <enumValues>
    <name>AAA</name>
  </enumValues>
  <enumValues>
    <name>AA_plus</name>
  </enumValues>
  <enumValues>
    <name>AA</name>
  </enumValues>
  <enumValues>
    <name>AA_minus</name>
  </enumValues>
  <enumValues>
    <name>A_plus</name>
  </enumValues>
  <enumValues>
    <name>A</name>
  </enumValues>
  <enumValues>
    <name>A_minus</name>
  </enumValues>
  <enumValues>
    <name>BBB_plus</name>
  </enumValues>
  <enumValues>
    <name>BBB</name>
  </enumValues>
  <enumValues>
    <name>BBB_minus</name>
  </enumValues>
  <enumValues>
    <name>BB_plus</name>
  </enumValues>
  <enumValues>
    <name>BB</name>
  </enumValues>
  <enumValues>
    <name>BB_minus</name>
  </enumValues>
  <enumValues>
    <name>B_plus</name>
  </enumValues>
  <enumValues>
    <name>B</name>
  </enumValues>
  <enumValues>
    <name>B_minus</name>
  </enumValues>
  <enumValues>
    <name>CCC_plus_C_minus</name>
  </enumValues>
  <enumValues>
    <name>NotRated</name>
  </enumValues>
  <enumValues>
    <name>D</name>
  </enumValues>
</mdclass:Enum>

fa-xbrl/src/Enums/velpo_ConsolidatedRatings/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

Function GetApprovedConsolidatedRatings() Export

	// import
	ConsolidatedRatings = Enums.velpo_ConsolidatedRatings;
	
	ApprovedConsolidatedRatings = New Map;
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.AAA, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.AA_plus, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.AA, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.AA_minus, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.A_plus, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.A, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.A_minus, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.BBB_plus, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.BBB, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.BBB_minus, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.BB_plus, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.BB, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.BB_minus, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.B_plus, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.B, True);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.B_minus, False);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.CCC_plus_C_minus, False);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.NotRated, False);
	ApprovedConsolidatedRatings.Insert(ConsolidatedRatings.D, False);

	Return ApprovedConsolidatedRatings; 
	
EndFunction

#EndIf
